In [30]:
import pandas as pd

In [31]:
df_customer = pd.DataFrame({
    "CustomerId":[1,2,3],
    "CustomerName":["Ramesh","Suresh","Kalpesh"]
})
df_oreder = pd.DataFrame({
    "CustomerId":[2,1,4],
    "OrderAmt":[400,899,599]
})

# like sql table joining

# inner joining
df_marge = pd.merge(df_customer,df_oreder,on="CustomerId",how="inner")
df_marge

   CustomerId CustomerName  OrderAmt
0           1       Ramesh       899
1           2       Suresh       400

In [32]:
# outer joining
df_marge = pd.merge(df_customer,df_oreder,on="CustomerId",how="outer")
df_marge

   CustomerId CustomerName  OrderAmt
0           1       Ramesh     899.0
1           2       Suresh     400.0
2           3      Kalpesh       NaN
3           4          NaN     599.0

In [33]:
# left join
df_marge = pd.merge(df_customer,df_oreder,on="CustomerId",how="left")
df_marge

   CustomerId CustomerName  OrderAmt
0           1       Ramesh     899.0
1           2       Suresh     400.0
2           3      Kalpesh       NaN

In [34]:
# right join
df_marge = pd.merge(df_customer,df_oreder,on="CustomerId",how="right")
df_marge

   CustomerId CustomerName  OrderAmt
0           2       Suresh       400
1           1       Ramesh       899
2           4          NaN       599